config/Catalogs/Промоакции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Промоакции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведенияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведенияПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАкции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПриРасчетеПотребности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварныеПозиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код1С</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Склад</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аптека</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код1С</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/InformationRegisters/СкоростиРозничногоАЗДляАкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СкоростиРозничногоАЗДляАкций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скорость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Промоакция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Промоакции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Аптека</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/InformationRegisters/СкоростиПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СкоростиПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скорость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаАП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/InformationRegisters/ЛогОшибокОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЛогОшибокОбработок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоВозникновения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаОшибки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/Catalogs/Промоакции/Ext/ObjectModule.bsl
Перем ТЧВызова Экспорт;

Процедура УбратьДублиИзТаблиц() Экспорт
	
	ТЗСв = Склад.Выгрузить();
	ТЗСв.Свернуть("Код1С,Аптека","");
	Склад.Загрузить(ТЗСв);
	
	ТЗСв = ТоварныеПозиции.Выгрузить();
	ТЗСв.Свернуть("Код1С,Товар","");
	ТоварныеПозиции.Загрузить(ТЗСв);
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	УбратьДублиИзТаблиц();	
	
	//ENT-1491 +++
	Попытка
		
		Если ЭтоНовый() ТОгда
			СпрСсылка = Справочники.Промоакции.ПолучитьСсылку();
			ЭтотОбъект.УстановитьСсылкуНового(СпрСсылка);
		Иначе
			СпрСсылка = Ссылка;
		КонецЕсли;
		
		Если ДатаПроведенияС > ТекущаяДата() Тогда 	
			УчитыватьПриРасчетеПотребности = Истина;	
		КонецЕсли; 
		
		Если ДатаПроведенияС < НачалоДня(ТекущаяДата()) и НачалоДня(ТекущаяДата())<= ДатаПроведенияПо Тогда
			ЕстьОшибка = Ложь;
			
			Для Каждого стрАпт из Склад Цикл
				НаборЗаписей = РегистрыСведений.СкоростиРозничногоАЗДляАкций.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Период.Установить(ДатаПроведенияС);
				НаборЗаписей.Отбор.Аптека.установить(СтрАпт.Аптека);
				НаборЗаписей.Прочитать();			
				Если НаборЗаписей.Количество() = 0 Тогда
					ЕстьОшибка = Истина;
					Сообщить("Для аптеки " + Строка(стрАпт.Аптека) + " на текущую дату не найдено рассчитанных скоростей");
					Продолжить;
				КонецЕсли;	
				Для Каждого стрТовар из ТоварныеПозиции Цикл
					НаборЗаписей = РегистрыСведений.СкоростиРозничногоАЗДляАкций.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Аптека.установить(СтрАпт.Аптека);
					НаборЗаписей.Отбор.Период.Установить(ДатаПроведенияС);
					НаборЗаписей.Отбор.Товар.Установить(стрТовар.Товар);
					НаборЗаписей.Прочитать();   		
					Если НаборЗаписей.Количество() = 0 Тогда
						Сообщить("Для аптеки " + Строка(стрАпт.Аптека) + " не найден сохраненный расчет скорости по товару " + Строка(стрТовар.Товар));
						ЕстьОшибка = Истина;
						Продолжить;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			УчитыватьПриРасчетеПотребности = НЕ ЕстьОшибка;	
			Если ЕстьОшибка Тогда 
				Сообщить("По заданным условиям акции нет данных для снижения потребности по окончанию акции. Для уточнения возможности автоматического выхода из акции при расчете потребности обратитесь в поддержку");
			КонецЕсли;
		КонецЕсли;
		
		
		Если ДатаПроведенияС = НачалоДня(ТекущаяДата()) и НачалоДня(ТекущаяДата())<= ДатаПроведенияПо Тогда
			ЕстьОшибка = Ложь;		
			Для Каждого стрАпт из Склад Цикл
				НаборЗаписей = РегистрыСведений.СкоростиПродаж.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.КодАптеки.установить(СтрАпт.Код1С);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() = 0 Тогда
					ЕстьОшибка = Истина;
					Сообщить("Для аптеки " + Строка(стрАпт.Аптека) + " на текущую дату не найдено рассчитанных скоростей");
					Продолжить;
				КонецЕсли;
				Для Каждого стрТовар из ТоварныеПозиции Цикл
					НаборЗаписей = РегистрыСведений.СкоростиПродаж.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.КодАптеки.установить(СтрАпт.Код1С);
					НаборЗаписей.Отбор.КодТовара.Установить(стрТовар.Код1С);
					НаборЗаписей.Прочитать();   		
					Если НаборЗаписей.Количество() = 0 Тогда
						Сообщить("Для аптеки " + Строка(стрАпт.Аптека) + " не найден сохраненный расчет скорости по товару " + Строка(стрТовар.Товар));
						ЕстьОшибка = Истина;
						Продолжить;
					Иначе
						Запись = РегистрыСведений.СкоростиРозничногоАЗДляАкций.СоздатьМенеджерЗаписи();
						Запись.Период = ДатаПроведенияС;
						Запись.Аптека = стрАпт.Аптека;
						ЗАпись.Товар = стрТовар.Товар;
						Запись.Промоакция = Ссылка ; 
						Запись.Скорость = НаборЗаписей[0].скорость;
						Запись.Записать(Истина);
					КонецЕсли;
				КонецЦикла;			
			КонецЦикла;
			УчитыватьПриРасчетеПотребности = НЕ ЕстьОшибка;		
			Если ЕстьОшибка Тогда 
				Сообщить("По заданным условиям акции нет данных для снижения потребности по окончанию акции. Для уточнения возможности автоматического выхода из акции при расчете потребности обратитесь в поддержку");
			КонецЕсли;
		КонецЕсли;
		
		Если (ДатаПроведенияПо-7*24*60*60)< НачалоДня(ТекущаяДата()) и ДатаПроведенияПо >= НачалоДня(ТекущаяДата()) и УчитыватьПриРасчетеПотребности Тогда
			Сообщить("По заданным условиям акции с " + Формат(КонецДня(ТекущаяДата())+ 1,"ДЛФ=ДД") + " расчет потребности указанных аптек в акционном товаре будет ограничен показателями на начало акции");
		КонецЕсли;
	Исключение
		Ош = ИнформацияОбОшибке();
		Запись = РегистрыСведений.ЛогОшибокОбработок.СоздатьМенеджерЗаписи();
		Запись.ДатаОшибки = ТекущаяДата();
		Запись.Объект = "Суперпромо, дата проведения: " + Строка(ДатаПроведенияС);
		Запись.ОписаниеОшибки = ош.Описание;
		ЗАпись.МестоВозникновения = "Процедура ""ПередЗаписью""";
		Запись.Записать();
	КонецПопытки;
	//---
	
КонецПроцедуры
